In [1]:
import pandas as pd

In [2]:
df=pd.read_csv('ttrain.csv')

In [3]:
df2=pd.read_csv('ttest.csv')

In [4]:
df=pd.concat([df,df2])

In [5]:
df['Title']=df['Name'].str.extract('([A-Za-z]+)\.')

In [6]:
df['Title']=df['Title'].replace(['Ms','Mlle'],'Miss')
df['Title']=df['Title'].replace(['Mme','Countess','Lady','Dona'],'Mrs')
df['Title']=df['Title'].replace(['Rev','Dr','Col','Major','Sir','Don','Capt','Jonkheer'],'Mr')

In [7]:
df['Age']=df['Age'].fillna(df.groupby('Title')['Age'].transform('median'))

In [8]:
df['Fare']=df['Fare'].fillna(df['Fare'].mode()[0])

In [9]:
df['Embarked']=df['Embarked'].fillna(df['Embarked'].mode()[0])

In [10]:
df=df.drop(['PassengerId','Ticket','Cabin','Name'],axis=1)

In [11]:
df=pd.get_dummies(df,drop_first=True)

In [12]:
df.head()

,Survived,Pclass,Age,SibSp,Parch,Fare,Sex_male,Embarked_Q,Embarked_S,Title_Miss,Title_Mr,Title_Mrs
0,0.0,3,22.0,1,0,7.2500,True,False,True,False,True,False
1,1.0,1,38.0,1,0,71.2833,False,False,False,False,False,True
2,1.0,3,26.0,0,0,7.9250,False,False,True,True,False,False
3,1.0,1,35.0,1,0,53.1000,False,False,True,False,False,True
4,0.0,3,35.0,0,0,8.0500,True,False,True,False,True,False

In [13]:
titanicnew=df

In [14]:
titanicnew.to_csv('titanicnew.csv', index=False)

In [15]:
titanicnew.head()

,Survived,Pclass,Age,SibSp,Parch,Fare,Sex_male,Embarked_Q,Embarked_S,Title_Miss,Title_Mr,Title_Mrs
0,0.0,3,22.0,1,0,7.2500,True,False,True,False,True,False
1,1.0,1,38.0,1,0,71.2833,False,False,False,False,False,True
2,1.0,3,26.0,0,0,7.9250,False,False,True,True,False,False
3,1.0,1,35.0,1,0,53.1000,False,False,True,False,False,True
4,0.0,3,35.0,0,0,8.0500,True,False,True,False,True,False

In [16]:
titanicnew.isnull().sum()

Survived      418
Pclass          0
Age             0
SibSp           0
Parch           0
Fare            0
Sex_male        0
Embarked_Q      0
Embarked_S      0
Title_Miss      0
Title_Mr        0
Title_Mrs       0
dtype: int64